{
    "id": "register",
    "name": "TARGET_NAME",
    "type": "pnj",
    "custom": "",
    "dialog": [
        {
            "id": "bonjour",
            "text": "Encore toi, petite âme?<br \/>Quel corps choisis-tu cette fois-ci?",
            "shuffle": 1,
            "options": [
                {
                    "go": "nain",
                    "text": "Nain (2 âmes)"
                },
                {
                    "go": "elfe",
                    "text": "Elfe (0 âmes) <font color='gold'>+20Po en bonus!<\/font>"
                }
            ]
        },
        {
            "id": "olympien",
            "text": "De loin, on ne peut les différencier des Humains de Terra mais de près on se rend compte qu'ils sont bien plus massifs et résistants que ces derniers. Leurs côtes sont remplacées par une plaque de cartilage couvrant complètement la poitrine et le ventre et leurs yeux sont la plupart du temps orange. Leurs compétences sont très équilibrées. On dit qu'un bataillon d'Olympiens bien dirigé écrase les troupes de n'importe quelle autre race.",
            "options": [
                {
                    "go": "name",
                    "set": {
                        "race": "olympien"
                    },
                    "text": "Va pour un Olympien."
                },
                {
                    "go": "bonjour",
                    "text": "Finalement, non."
                }
            ]
        },
        {
            "id": "nain",
            "text": "De très petite taille, les Nains sont presque aussi larges que hauts. Leur barbe toujours bien entretenue est leur fierté mais aussi un bon moyen de les reconnaître. Les nains vivent dans des cités souterraines et sont de bons armuriers et inventeurs. Terriblement efficaces en combat rapproché, ils résistent correctement aux tirs et un peu moins bien à la magie. Leur lenteur massive reste leur défaut principal.",
            "options": [
                {
                    "go": "name",
                    "set": {
                        "race": "nain"
                    },
                    "text": "Va pour un Nain."
                },
                {
                    "go": "bonjour",
                    "text": "Finalement, non."
                }
            ]
        },
        {
            "id": "elfe",
            "text": "C'est une race élancée aux allures nobles. Ils existaient avant les Olympiens et ne vénèrent pas les Dieux de l'Olympe. Les Elfes sont des créatures vivant dans les forêts et qui n'en sortent que rarement. Doués en magie et plutôt bons en tir, les Elfes sont cependant de biens piètres guerriers de mêlée.",
            "options": [
                {
                    "go": "name",
                    "set": {
                        "race": "elfe"
                    },
                    "text": "Va pour un Elfe."
                },
                {
                    "go": "bonjour",
                    "text": "Finalement, non."
                }
            ]
        },
        {
            "id": "hs",
            "text": "Leur stature très fine presque fragile leur confère une agilité hors du commun. Ils sont très forts en magie et excessivement difficiles à atteindre, mais qu'ils soient blessés et leurs battements de cœur sont comptés...",
            "options": [
                {
                    "go": "name",
                    "set": {
                        "race": "hs"
                    },
                    "text": "Va pour un Homme-Sauvage."
                },
                {
                    "go": "bonjour",
                    "text": "Finalement, non."
                }
            ]
        },
        {
            "id": "geant",
            "text": "Les géants possèdent une force hallucinante qui accompagne leur grande taille. Habitués à chasser dans les montagnes, ils sont également très doués au tir, mais peu habitués aux combats à grande échelle. Il est bien connu que ces colosses font souvent des cibles faciles et il est dangereux pour eux de trop s'exposer sur les fronts.",
            "options": [
                {
                    "go": "name",
                    "set": {
                        "race": "geant"
                    },
                    "text": "Va pour un Géant."
                },
                {
                    "go": "bonjour",
                    "text": "Finalement, non."
                }
            ]
        },
        {
            "id": "name",
            "text": "Peux-tu me dire le nom que portera ton incarnation?<table><tr><td>Nom:<\/td><td><input type='text' name='name' autocomplete='off' \/><\/td><\/tr><\/table>",
            "options": [
                {
                    "go": "conclusion",
                    "text": "[continuer]"
                }
            ]
        },
        {
            "id": "conclusion",
            "text": "Va, maintenant. Je te prédis un grand destin.",
            "options": [
                {
                    "go": "register",
                    "text": "Soit. [se réincarner]"
                },
                {
                    "go": "RESET",
                    "text": "NON! Attends!! [recommencer]"
                }
            ]
        },
        {
            "id": "register",
            "text": "",
            "options": []
        }
    ]
}